
<!DOCTYPE HTML>
<html lang="ja" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>セクション１ · mirameet</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="HonKit 3.6.11">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro-fixed/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-navigator/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-collapsible-chapters/collapsible-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-hints/plugin-hints.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Section2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book honkit-cloak">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="検索ワードを入力" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    はじめに
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="Section1.html">
            
                <a href="Section1.html">
            
                    
                    セクション１
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="Section2.html">
            
                <a href="Section2.html">
            
                    
                    セクション２
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Section3.html">
            
                <a href="Section3.html">
            
                    
                    セクション３
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Section4.html">
            
                <a href="Section4.html">
            
                    
                    セクション４
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Section5.html">
            
                <a href="Section5.html">
            
                    
                    セクション５
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Tips</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="Chocolatery.html">
            
                <a href="Chocolatery.html">
            
                    
                    Chocolateryインストール手順
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="Homebrew.html">
            
                <a href="Homebrew.html">
            
                    
                    Homebrewインストール手順
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="Company.html">
            
                <a href="Company.html">
            
                    
                    会社紹介
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://github.com/honkit/honkit" target="blank" class="gitbook-link">
            HonKitで公開 
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >セクション１</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="Section1"><a name="section1" class="plugin-anchor" href="#section1"><i class="fa fa-link" aria-hidden="true"></i></a>Section1</h1>
<h3 id="&#x76EE;&#x6B21;">0.1. &#x76EE;&#x6B21;</h3>
<p>No.1 Docker&#x3068;&#x306F;<br>
No.2 Kubernetes&#x3068;&#x306F;<br>
No.3 Kubernetes&#x306E;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x6982;&#x8981;<br>
No.4 Kompose&#x3068;&#x306F;<br></p>
<p><br><br></p>
<h2 id="Docker&#x3068;&#x306F;">1. Docker&#x3068;&#x306F;</h2>
<h3 id="&#x6982;&#x8981;">1.1. &#x6982;&#x8981;</h3>
<p>&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x6280;&#x8853;&#x3092;&#x4F7F;&#x3063;&#x305F;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x5B9F;&#x884C;&#x74B0;&#x5883;&#x3092;&#x69CB;&#x7BC9;/&#x904B;&#x7528;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30D7;&#x30E9;&#x30C3;&#x30C8;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x3067;&#x3059;&#x3002;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x5B9F;&#x884C;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x7269;&#x3092;&#x4E00;&#x3064;&#x306B;&#x307E;&#x3068;&#x3081;&#x3001;Docker&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x53EF;&#x642C;&#x6027;&#x3092;&#x4E0A;&#x3052;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
<br></p>
<h3 id="&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3068;&#x306F;">1.2. &#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3068;&#x306F;</h3>
<p>&#x73FE;&#x5B9F;&#x4E16;&#x754C;&#x3067;&#x8868;&#x3059;&#x3068;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x7269;&#x3067;&#x3059;&#x3002;<br></p>
<p>&#xFF08;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306E;&#x5199;&#x771F;&#xFF09;</p>
<p>&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306F;&#x5185;&#x90E8;&#x306B;&#x7269;&#x3092;&#x8CAF;&#x3081;&#x308B;&#x5BB9;&#x5668;&#x3067;&#x904B;&#x642C;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;<br>
&#x9678;&#x304B;&#x3089;&#x8239;&#x306B;&#x904B;&#x3076;&#x969B;&#x306B;&#x30AF;&#x30EC;&#x30FC;&#x30F3;&#x306A;&#x3069;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3092;&#x79FB;&#x52D5;&#x3055;&#x305B;&#x307E;&#x3059;&#x3002;<br>
&#x3053;&#x306E;&#x3088;&#x3046;&#x306B;&#x73FE;&#x5B9F;&#x4E16;&#x754C;&#x3067;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306F;&#x975E;&#x5E38;&#x306B;&#x4FBF;&#x5229;&#x3067;&#x7269;&#x3092;&#x8CAF;&#x3081;&#x3066;&#x6301;&#x3061;&#x904B;&#x3076;&#x306E;&#x3092;&#x5BB9;&#x6613;&#x306B;&#x3057;&#x3066;&#x304F;&#x308C;&#x307E;&#x3059;&#x3002;<br><br></p>
<p>&#x3067;&#x306F;&#x3001;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306E;&#x4E16;&#x754C;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3068;&#x306F;&#x4E00;&#x4F53;&#x3069;&#x3093;&#x306A;&#x3082;&#x306E;&#x306A;&#x306E;&#x304B;&#xFF1F;<br><br></p>
<p>&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306F;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x5B9F;&#x884C;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x30E2;&#x30B8;&#x30E5;&#x30FC;&#x30EB;&#xFF08;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3084;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x7FA4;&#xFF09;&#x3092;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3068;&#x3057;&#x3066;&#x307E;&#x3068;&#x3081;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x3001;&#x8907;&#x6570;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x308B;&#x3053;&#x3068;&#x3067;&#xFF11;&#x3064;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x69CB;&#x7BC9;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
&#x3057;&#x304B;&#x3082;&#x3053;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306E;&#x5143;&#x3068;&#x306A;&#x308B;Docker&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3092;Docker Hub&#xFF08;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#xFF09;&#x306A;&#x3069;&#x306E;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x3067;&#x5171;&#x6709;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x3001;Docker&#x3092;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x3044;&#x308B;&#x74B0;&#x5883;&#x3067;&#x3042;&#x308C;&#x3070;&#x8AB0;&#x3067;&#x3082;&#x4E00;&#x7DD2;&#x306E;&#x74B0;&#x5883;&#x3092;&#x69CB;&#x7BC9;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;<br><br></p>
<h3 id="Docker&#x306E;&#x30E1;&#x30EA;&#x30C3;&#x30C8;">1.3. Docker&#x306E;&#x30E1;&#x30EA;&#x30C3;&#x30C8;</h3>
<h4 id="&#x30FB;&#x8CC7;&#x6E90;&#x306E;&#x52B9;&#x7387;&#x5316;">1.3.1. &#x30FB;&#x8CC7;&#x6E90;&#x306E;&#x52B9;&#x7387;&#x5316;</h4>
<p>Docker&#x306F;&#x30DB;&#x30B9;&#x30C8;&#x30AB;&#x30FC;&#x30CD;&#x30EB;&#x3092;&#x5171;&#x6709;&#x3057;&#x3001;&#x5F93;&#x6765;&#x306E;&#x30CF;&#x30A4;&#x30D1;&#x30FC;&#x30D0;&#x30A4;&#x30B6;&#x578B;&#x306E;Hyper-V&#x3084;&#x30DB;&#x30B9;&#x30C8;&#x578B;&#x306E;VirtualBox&#x7B49;&#x306E;&#x3088;&#x3046;&#x306B;OS&#x3092;&#x4E38;&#x3054;&#x3068;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x306A;&#x304F;&#x8CC7;&#x6E90;&#x3092;&#x52B9;&#x7387;&#x7684;&#x306B;&#x6271;&#x3048;&#x308B;&#x3002;<br>
<img src="https://d33wubrfki0l68.cloudfront.net/26a177ede4d7b032362289c6fccd448fc4a91174/eb693/images/docs/container_evolution.svg" alt="VM&#x30FB;Docker"></p>
<h4 id="&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x5B9F;&#x884C;&#x74B0;&#x5883;&#x69CB;&#x7BC9;&#x306E;&#x5BB9;&#x6613;&#x3055;">1.3.2. &#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x5B9F;&#x884C;&#x74B0;&#x5883;&#x69CB;&#x7BC9;&#x306E;&#x5BB9;&#x6613;&#x3055;</h4>
<p>Docker&#x306F;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x3092;&#x540C;&#x4E00;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x5185;&#x306B;&#x56FA;&#x3081;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x3001;&#x4E00;&#x5EA6;&#x56FA;&#x3081;&#x305F;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306F;&#x8EFD;&#x91CF;&#x3067;&#x6301;&#x3061;&#x904B;&#x3073;&#x304C;&#x5BB9;&#x6613;&#x3002;Docker&#x304C;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;OS&#x3067;&#x3042;&#x308C;&#x3070;&#x79FB;&#x52D5;&#x304C;&#x5BB9;&#x6613;&#x306B;&#x884C;&#x3048;&#x308B;&#x3002;<br>
<img src="img/docker-image.png" alt="Docker&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;"></p>
<h4 id="&#x30FB;&#x8A2D;&#x5B9A;&#x9593;&#x9055;&#x3044;&#x306A;&#x3069;&#x306E;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x64CD;&#x4F5C;&#x306E;&#x5EC3;&#x68C4;&#x306E;&#x5BB9;&#x6613;&#x3055;">1.3.3. &#x30FB;&#x8A2D;&#x5B9A;&#x9593;&#x9055;&#x3044;&#x306A;&#x3069;&#x306E;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x64CD;&#x4F5C;&#x306E;&#x5EC3;&#x68C4;&#x306E;&#x5BB9;&#x6613;&#x3055;</h4>
<p>&#x8907;&#x96D1;&#x306A;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3042;&#x308C;&#x3070;&#x4E00;&#x5EA6;&#x8A2D;&#x5B9A;&#x3092;&#x9593;&#x9055;&#x3048;&#x308B;&#x3068;&#x3001;&#x5F71;&#x97FF;&#x7BC4;&#x56F2;&#x306E;&#x8ABF;&#x67FB;&#x306A;&#x3069;&#x306B;&#x6642;&#x9593;&#x304C;&#x304B;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3057;&#x304B;&#x3057;Docker&#x3067;&#x3042;&#x308C;&#x3070;&#x8A2D;&#x5B9A;&#x3092;&#x9593;&#x9055;&#x3048;&#x305F;&#x3068;&#x601D;&#x3048;&#x3070;&#x3059;&#x3050;&#x3055;&#x307E;&#x524A;&#x9664;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;&#x5909;&#x66F4;&#x3082;&#x300C;Docker file&#x300D;&#x3092;&#x4FEE;&#x6B63;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x518D;&#x69CB;&#x7BC9;&#x3067;&#x304D;&#x3001;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x3092;&#x6BB5;&#x968E;&#x7684;&#x306B;&#x6B8B;&#x3057;&#x3066;&#x304A;&#x304F;&#x3053;&#x3068;&#x3067;&#x8A2D;&#x5B9A;&#x9593;&#x9055;&#x3044;&#x306E;&#x524D;&#x306E;&#x72B6;&#x614B;&#x306B;&#x3059;&#x3050;&#x306B;&#x3082;&#x3069;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;<br><br><br></p>
<h2 id="Kubernetes(K8s)&#x3068;&#x306F;">2. Kubernetes(K8s)&#x3068;&#x306F;</h2>
<p>Kubernetes&#xFF08;&#x30AF;&#x30D0;&#x30CD;&#x30C6;&#x30A3;&#x30B9;/&#x30AF;&#x30D0;&#x30CD;&#x30C6;&#x30B9;/&#x30AF;&#x30FC;&#x3079;&#x30CD;&#x30C6;&#x30A3;&#x30B9;&#x3001;K8s&#xFF09;&#x306F;&#x3001;&#x7C73;Google&#x306E;&#x30A8;&#x30F3;&#x30B8;&#x30CB;&#x30A2;&#x3092;&#x4E2D;&#x5FC3;&#x3068;&#x3059;&#x308B;&#x30B3;&#x30DF;&#x30E5;&#x30CB;&#x30C6;&#x30A3;&#x3067;&#x958B;&#x767A;&#x304C;&#x9032;&#x3081;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3001;&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x30BD;&#x30FC;&#x30B9;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3059;&#x3002;Google&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;Microsoft,Rds Hat,IBM&#x306A;&#x3069;&#x304C;&#x958B;&#x767A;&#x306B;&#x53C2;&#x52A0;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x63D0;&#x4F9B;&#x6A5F;&#x80FD;&#x3082;&#x8C4A;&#x5BCC;&#x3067;&#x958B;&#x767A;&#x30B9;&#x30D4;&#x30FC;&#x30C9;&#x3082;&#x65E9;&#x304F;&#x3001;&#x5927;&#x898F;&#x6A21;&#x306A;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306E;&#x5C0E;&#x5165;&#x5B9F;&#x7E3E;&#x3082;&#x8C4A;&#x5BCC;&#x3067;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30C4;&#x30FC;&#x30EB;&#x306E;&#x30C7;&#x30D5;&#x30A1;&#x30AF;&#x30C8;&#x30B9;&#x30BF;&#x30F3;&#x30C0;&#x30FC;&#x30C8;&#x3068;&#x3082;&#x8A00;&#x3048;&#x307E;&#x3059;&#x3002;<br>
&#x203B;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30C4;&#x30FC;&#x30EB;&#x306F;Kubernets&#x4EE5;&#x5916;&#x306B;&#x3082;&#x3001;docker Swarm&#x3084;Apache Mesos&#x306A;&#x3069;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;<br></p>
<h3 id="&#x306A;&#x305C;Kubernetes&#x306A;&#x3069;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x3042;&#x308B;&#x306E;&#x304B;">2.1. &#x306A;&#x305C;Kubernetes&#x306A;&#x3069;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x3042;&#x308B;&#x306E;&#x304B;</h3>
<p>&#x3082;&#x3057;Kubernertes&#x306A;&#x3069;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x306A;&#x304B;&#x3063;&#x305F;&#x5834;&#x5408;&#x3001;&#x8907;&#x6570;&#x306E;Docker&#x306E;&#x7BA1;&#x7406;&#x3001;&#x30DB;&#x30B9;&#x30C8;&#x304C;&#x9055;&#x3046;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x9593;&#x306E;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x7BA1;&#x7406;&#x3001;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306E;&#x76E3;&#x8996;&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x304C;&#x505C;&#x6B62;&#x3057;&#x305F;&#x969B;&#x306E;&#x5BFE;&#x5FDC;&#x306A;&#x3069;&#x304C;&#x5927;&#x5909;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x5C0F;&#x898F;&#x6A21;&#x306E;&#x5834;&#x5408;&#x306F;&#x5225;&#x9014;&#x4F5C;&#x696D;&#x3059;&#x308C;&#x3070;&#x3044;&#x3044;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x898F;&#x6A21;&#x304C;&#x5927;&#x304D;&#x304F;&#x306A;&#x308B;&#x307B;&#x3069;&#x7169;&#x96D1;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;<br><br></p>
<p>&#x4F8B;
DB&#x3092;&#x5FC5;&#x8981;&#x3068;&#x3057;&#x306A;&#x3044;&#x5358;&#x7D14;&#x306A;web&#x30B5;&#x30A4;&#x30C8;&#x304C;&#x3042;&#x308B;&#x3068;&#x3057;&#x307E;&#x3059;&#x3002;&#x4E00;&#x53F0;&#x306E;Docker&#x304C;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x306B;nginx&#x3068;php&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3092;&#x7ACB;&#x3066;&#x307E;&#x3059;&#x3002;&#x6700;&#x521D;&#x306E;&#x9803;&#x306F;&#x554F;&#x984C;&#x306A;&#x304F;&#x52D5;&#x3044;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x6570;&#x304C;&#x5897;&#x3048;&#x305F;&#x305F;&#x3081;&#x3082;&#x3046;&#x4E00;&#x3064;&#x540C;&#x3058;&#x69CB;&#x9020;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3092;&#x7ACB;&#x3066;&#x307E;&#x3059;&#x3002;&#x3055;&#x3089;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x6570;&#x304C;&#x5897;&#x3048;&#xFF11;&#xFF10;&#x53F0;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3092;&#x7ACB;&#x3066;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x306B;&#x306F;nginx&#x3068;php&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x304C;&#x7ACB;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x3053;&#x308C;&#x3089;nginx&#x3068;php&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x304C;&#x7ACB;&#x3063;&#x3066;&#x3044;&#x308B;&#xFF11;&#xFF10;&#x53F0;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x306E;&#x9762;&#x5012;&#x3092;&#x898B;&#x308B;&#x3068;&#x306A;&#x308B;&#x3068;&#x304B;&#x306A;&#x308A;&#x5927;&#x5909;&#x3067;&#x3059;&#x3002;
&#x305D;&#x3053;&#x3067;&#x4F7F;&#x3046;&#x306E;&#x304C;&#x3001;k8s&#x306A;&#x3069;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3059;&#x3002;&#x3053;&#x306E;k8s&#x306A;&#x3069;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x4E00;&#x53F0;&#x305A;&#x3064;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3092;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x306A;&#x304F;&#x306A;&#x308A;&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x304C;&#xFF11;&#x3064;&#x30C0;&#x30A6;&#x30F3;&#x3057;&#x305F;&#x969B;&#x306B;&#x306F;&#x81EA;&#x52D5;&#x3067;&#x65B0;&#x3057;&#x3044;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3092;&#x7ACB;&#x3066;&#x3066;&#x304F;&#x308C;&#x305F;&#x308A;&#x3001;&#x76E3;&#x8996;&#x3059;&#x308B;&#x306E;&#x3082;&#x4E00;&#x53F0;&#x305A;&#x3064;&#x3067;&#x306F;&#x306A;&#x304F;&#xFF11;&#xFF10;&#x53F0;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3068;&#x3059;&#x3079;&#x3066;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3092;&#x307E;&#x3068;&#x3081;&#x3066;&#x76E3;&#x8996;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;<br><br></p>
<p>&#x3053;&#x306E;&#x3088;&#x3046;&#x306B;k8s&#x304C;&#x3042;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x3001;&#x898F;&#x6A21;&#x306E;&#x5927;&#x304D;&#x3044;Docker&#x306E;&#x7BA1;&#x7406;&#x3084;&#x81EA;&#x52D5;&#x5316;&#x3092;&#x5BB9;&#x6613;&#x306B;&#x884C;&#x3048;&#x307E;&#x3059;&#x3002;<br><br><br></p>
<h2 id="Kubernetes&#x306E;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x6982;&#x8981;">3. Kubernetes&#x306E;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x6982;&#x8981;</h2>
<h3 id="&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;">3.1. &#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;</h3>
<p>&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x3068;&#x306F;k8s&#x3092;&#x69CB;&#x6210;&#x3057;&#x3066;&#x3044;&#x308B;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;<br>
&#x5927;&#x304D;&#x304F;&#x5206;&#x3051;&#x3066;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30D7;&#x30EC;&#x30FC;&#x30F3;&#x3068;&#x30CE;&#x30FC;&#x30C9;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<table>
<thead>
<tr>
<th style="text-align:left">&#x540D;&#x524D;</th>
<th style="text-align:left">&#x5F79;&#x5272;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">Control Planes</td>
<td style="text-align:left">k8s&#x306E;&#x5FC3;&#x81D3;&#x90E8;&#x5206;&#x3002;&#x6307;&#x63EE;&#x8005;&#x7684;&#x306A;&#x5F79;&#x5272;<br>&#x5225;&#x540D;&#xFF1A;Admin&#x3001;Master</td>
</tr>
<tr>
<td style="text-align:left">Nodes</td>
<td style="text-align:left">&#x5B9F;&#x969B;&#x306B;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x304C;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x74B0;&#x5883;&#x3002;&#x6F14;&#x594F;&#x3059;&#x308B;&#x5074;<br>&#x5225;&#x540D;&#xFF1A;worker</td>
</tr>
</tbody>
</table>
<p><br></p>
<p><img src="https://d33wubrfki0l68.cloudfront.net/7016517375d10c702489167e704dcb99e570df85/7bb53/images/docs/components-of-kubernetes.png" alt="&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;"></p>
<p><br>
&#x753B;&#x50CF;&#x5143;<a href="https://kubernetes.io/ja/docs/concepts/overview/components/" target="_blank">https://kubernetes.io/ja/docs/concepts/overview/components/</a>
<br></p>
<h3 id="&#x30AF;&#x30E9;&#x30B9;&#x30BF;(Kubernetes_Cluster)">3.2. &#x30AF;&#x30E9;&#x30B9;&#x30BF;(Kubernetes Cluster)</h3>
<p>&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x3068;&#x306F;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;Kubernetes&#x304C;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x7269;&#x7406;&#x30DE;&#x30B7;&#x30F3;&#x3084;&#x4EEE;&#x60F3;&#x30DE;&#x30B7;&#x30F3;&#x3001;&#x305D;&#x306E;&#x4ED6;&#x306E;&#x30A4;&#x30F3;&#x30D5;&#x30E9;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306E;&#x30BB;&#x30C3;&#x30C8;&#x306E;&#x3053;&#x3068;&#x3092;&#x6307;&#x3057;&#x307E;&#x3059;&#x3002;<br>
&#x3064;&#x307E;&#x308A;&#x3001;Control Planes&#x3068;Nodes&#x306E;&#x304B;&#x305F;&#x307E;&#x308A;&#x3092;&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x3068;&#x547C;&#x3073;&#x307E;&#x3059;&#x3002;<br></p>
<h3 id="&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#xFF08;Control_Planes&#xFF09;">3.3. &#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#xFF08;Control Planes&#xFF09;</h3>
<h4 id="etcd(&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x30C7;&#x30FC;&#x30BF;&#x30D9;&#x30FC;&#x30B9;)">3.3.1. etcd(&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x30C7;&#x30FC;&#x30BF;&#x30D9;&#x30FC;&#x30B9;)</h4>
<p>etcd&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#x5206;&#x6563;&#x30AD;&#x30FC;&#x30D0;&#x30EA;&#x30E5;&#x30FC;&#x30B9;&#x30C8;&#x30A2;(KVS)&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3001;&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x306E;&#x69CB;&#x6210;&#x60C5;&#x5831;&#x3092;&#x7BA1;&#x7406;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x203B;KVS&#x3068;&#x306F;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x7BA1;&#x7406;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x7A2E;&#x985E;&#x306E;&#x4E00;&#x3064;&#x3067;&#x3001;&#x4FDD;&#x5B58;&#x3057;&#x305F;&#x3044;&#x30C7;&#x30FC;&#x30BF;&#xFF08;value&#xFF1A;&#x5024;&#xFF09;&#x306B;&#x5BFE;&#x3057;&#x3001;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x4E00;&#x610F;&#x306E;&#x6A19;&#x8B58;&#xFF08;key&#xFF1A;&#x30AD;&#x30FC;&#xFF09;&#x3092;&#x8A2D;&#x5B9A;&#x3057;&#x3001;&#x3053;&#x308C;&#x3089;&#x3092;&#x30DA;&#x30A2;&#x3067;&#x683C;&#x7D0D;&#x3059;&#x308B;&#x65B9;&#x5F0F;&#x3002;<br></p>
<h4 id="API_Server">3.3.2. API Server</h4>
<p>Kubernetes&#x306E;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x60C5;&#x5831;&#x3092;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30D5;&#x30ED;&#x30F3;&#x30C8;&#x30A8;&#x30F3;&#x30C9;&#x306E;REST API&#x3067;&#x3059;&#x3002;&#x4ED6;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306F;etcd&#x306E;&#x60C5;&#x5831;&#x306B;API Server&#x3092;&#x4ECB;&#x3057;&#x3066;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x307E;&#x3059;&#x3002;<br>
&#x307E;&#x305F;&#x3001;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DE;&#x304C;&#x3053;&#x306E;API Server&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&#x306B;&#x306F;&#x5F8C;&#x307B;&#x3069;&#x8AAC;&#x660E;&#x3059;&#x308B;Kubectl&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3084;Web&#x306E;GUI&#x30C4;&#x30FC;&#x30EB;&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;
Kubernetes&#x306E;&#x53D7;&#x4ED8;&#x5F79;&#x306E;&#x3088;&#x3046;&#x306A;&#x5B58;&#x5728;&#x3067;&#x3059;&#x3002;<br></p>
<h4 id="Scheduler">3.3.3. Scheduler</h4>
<p>Scheduler&#x306F;Pod&#x3092;&#x3069;&#x306E;&#x30CE;&#x30FC;&#x30C9;&#x3067;&#x52D5;&#x304B;&#x3059;&#x304B;&#x3092;&#x5236;&#x5FA1;&#x3059;&#x308B;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x3067;&#x3059;&#x3002;&#x30CE;&#x30FC;&#x30C9;&#x306E;&#x5272;&#x308A;&#x5F53;&#x3066;&#x3089;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;Pod&#x306B;&#x5BFE;&#x3057;&#x3066;&#x3001;k8s&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x306E;&#x72B6;&#x614B;&#x3092;&#x78BA;&#x304B;&#x3081;&#x3001;&#x7A7A;&#x304D;&#x30B9;&#x30DA;&#x30FC;&#x30B9;&#x3092;&#x63A2;&#x3057;&#x3066;Pod&#x3092;&#x5B9F;&#x884C;&#x3055;&#x305B;&#x308B;&#x30B9;&#x30B1;&#x30B8;&#x30E5;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x3092;&#x884C;&#x3044;&#x307E;&#x3059;&#x3002;<br></p>
<h4 id="Kube_Controller_Manager">3.3.4. Kube Controller Manager</h4>
<p>k8s&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x306E;&#x72B6;&#x614B;&#x3092;&#x5E38;&#x306B;&#x76E3;&#x8996;&#x3059;&#x308B;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x3067;&#x3059;&#x3002;&#x5B9A;&#x7FA9;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3067;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x3082;&#x306E;&#x3068;&#x5B9F;&#x969B;&#x306E;&#x30CE;&#x30FC;&#x30C9;&#x3084;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3067;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x72B6;&#x614B;&#x3092;&#x307E;&#x3068;&#x3081;&#x3066;&#x7BA1;&#x7406;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;<br></p>
<h4 id="Cloud_Controller_Manager">3.3.5. Cloud Controller Manager</h4>
<p>&#x30AF;&#x30E9;&#x30A6;&#x30C9;&#xFF08;AWS/GCP/Azuru&#x306A;&#x3069;&#xFF09;&#x306E;&#x6A5F;&#x80FD;&#x3068;&#x9023;&#x643A;&#x3059;&#x308B;(&#x30ED;&#x30FC;&#x30C9;&#x30D0;&#x30E9;&#x30F3;&#x30B5;&#x30FC;)<br></p>
<h3 id="&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#xFF08;Nodes&#xFF09;">3.4. &#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#xFF08;Nodes&#xFF09;</h3>
<table>
<thead>
<tr>
<th style="text-align:left">&#x540D;&#x524D;</th>
<th style="text-align:left">&#x5F79;&#x5272;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">kubelt</td>
<td style="text-align:left">&#x5404;&#x30CE;&#x30FC;&#x30C9;&#x3067;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x308B;&#x30A8;&#x30FC;&#x30B8;&#x30A7;&#x30F3;&#x30C8;<br>&#x30DE;&#x30B9;&#x30BF;&#x30FC;&#x30CE;&#x30FC;&#x30C9;&#x3068;&#x3084;&#x308A;&#x3068;&#x308A;&#x3057;&#x3066;&#x6307;&#x793A;&#x306B;&#x5F93;&#x3046;</td>
</tr>
<tr>
<td style="text-align:left">kube-proxy</td>
<td style="text-align:left">Node&#x306E;NW&#x30EB;&#x30FC;&#x30EB;&#xFF08;iptables&#x306A;&#x3069;&#xFF09;&#x3092;&#x8FFD;&#x52A0;&#x3001;&#x524A;&#x9664;&#x3001;&#x5909;&#x66F4;&#x3057;&#x3066;&#x3044;&#x308B;</td>
</tr>
<tr>
<td style="text-align:left">&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30E9;&#x30F3;&#x30BF;&#x30A4;&#x30E0;</td>
<td style="text-align:left">&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;</td>
</tr>
</tbody>
</table>
<h3 id="&#x30CE;&#x30FC;&#x30C9;(Node)">3.5. &#x30CE;&#x30FC;&#x30C9;(Node)</h3>
<p>&#x30CE;&#x30FC;&#x30C9;&#x306F;&#x3001;Kubernetes&#x3092;&#x5B9F;&#x884C;&#x3057;&#x3066;&#x3044;&#x308B;&#x7269;&#x7406;&#x30DE;&#x30B7;&#x30F3;&#x307E;&#x305F;&#x306F;&#x4EEE;&#x60F3;&#x30DE;&#x30B7;&#x30F3;&#x3067;&#x3001;&#x30DD;&#x30C3;&#x30C9;&#x3092;&#x52D5;&#x304B;&#x3057;&#x307E;&#x3059;&#x3002;&#x30CE;&#x30FC;&#x30C9;&#x306E;&#x7BA1;&#x7406;&#x306F;&#x30DE;&#x30B9;&#x30BF;&#x30FC;&#x30B5;&#x30FC;&#x30D0;&#x304C;&#x884C;&#x3044;&#x307E;&#x3059;&#x3002;
<br></p>
<p><img src="img/node.png" alt="Docker&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;"></p>
<h3 id="&#x30DD;&#x30C3;&#x30C9;(Pod)">3.6. &#x30DD;&#x30C3;&#x30C9;(Pod)</h3>
<p>Pod &#x306F;1&#x3064;&#x4EE5;&#x4E0A;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x304B;&#x3089;&#x69CB;&#x6210;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x306F;&#x9694;&#x96E2;&#x3055;&#x308C;&#x3066;&#x304A;&#x3089;&#x305A;&#x3001;IP Address&#x306A;&#x3069;&#x306F;&#x5171;&#x6709;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;Kubernetes&#x306E;&#x6700;&#x5C0F;&#x5358;&#x4F4D;&#x3067;&#x3059;&#x3002;
<br></p>
<p><img src="img/pod.png" alt="Docker&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;"></p>
<h3 id="&#x30EC;&#x30D7;&#x30EA;&#x30AB;&#x30BB;&#x30C3;&#x30C8;(Replica_Set)">3.7. &#x30EC;&#x30D7;&#x30EA;&#x30AB;&#x30BB;&#x30C3;&#x30C8;(Replica Set)</h3>
<p>&#x30EC;&#x30D7;&#x30EA;&#x30AB;&#x30BB;&#x30C3;&#x30C8;&#x306F;&#x3001;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x6570;&#x306E;&#x30DD;&#x30C3;&#x30C9;&#x30EC;&#x30D7;&#x30EA;&#x30AB;&#x304C;&#x3044;&#x3064;&#x3067;&#x3082;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x307E;&#x3059;&#x3002;&#x4E21;&#x65B9;&#x3068;&#x3082;&#x3001;&#x8907;&#x88FD;&#x3055;&#x308C;&#x305F;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x7C21;&#x5358;&#x306A;&#x30B9;&#x30B1;&#x30FC;&#x30EA;&#x30F3;&#x30B0;&#x3092;&#x53EF;&#x80FD;&#x306B;&#x3057;&#x3001;&#x30DD;&#x30C3;&#x30C9;&#x304C;&#x518D;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x3068;&#x304D;&#x3001;&#x307E;&#x305F;&#x306F;&#x5931;&#x6557;&#x3057;&#x305F;&#x3068;&#x304D;&#x306B;&#x30DD;&#x30C3;&#x30C9;&#x306E;&#x518D;&#x4F5C;&#x6210;&#x3092;&#x51E6;&#x7406;&#x3057;&#x307E;&#x3059;&#x3002;
&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x5185;&#x306B;Pod&#x3092;&#x3044;&#x304F;&#x3064;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x304A;&#x304F;&#x304B;&#x306E;&#x5024;&#x3092;&#x300C;&#x30EC;&#x30D7;&#x30EA;&#x30AB;&#x6570;&#x300D;&#x3068;&#x547C;&#x3073;&#x307E;&#x3059;&#x3002;<br>
&#x307E;&#x305F;&#x3001;Pod&#x304C;&#x30C0;&#x30A6;&#x30F3;&#x3057;&#x3066;&#x3057;&#x307E;&#x3063;&#x305F;&#x969B;&#x306B;&#x3082;&#x3001;Replica Set&#x306F;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x30EC;&#x30D7;&#x30EA;&#x30AB;&#x6570;&#x306B;&#x306A;&#x308B;&#x3088;&#x3046;&#x306B;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3092;&#x8D77;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><img src="img/replicaset.png" alt="Docker&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;"></p>
<h3 id="Deployments(&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;)">3.8. Deployments(&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;)</h3>
<p>Deployments&#x306F;Pod&#x3068;ReplicaSet&#x3092;&#x307E;&#x3068;&#x3081;&#x305F;&#x3082;&#x306E;&#x3067;&#x3001;ReplicaSet&#x306E;&#x5C65;&#x6B74;&#x3092;&#x7BA1;&#x7406;&#x3092;&#x3057;&#x307E;&#x3059;&#x3002;
Deployment&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x76EE;&#x7684;&#x306E;&#x72B6;&#x614B;&#x3092;&#x8A18;&#x8FF0;&#x3059;&#x308B;&#x3060;&#x3051;&#x3067;&#x3001;&#x76EE;&#x7684;&#x306E;&#x72B6;&#x614B;&#x306B;&#x5909;&#x66F4;&#x3057;&#x3066;&#x304F;&#x308C;&#x307E;&#x3059;&#x3002;<br></p>
<p><img src="img/deployment.png" alt="Docker&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;"></p>
<h3 id="Service(&#x30B5;&#x30FC;&#x30D3;&#x30B9;)">3.9. Service(&#x30B5;&#x30FC;&#x30D3;&#x30B9;)</h3>
<p>&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306F;&#x3001;&#x5358;&#x4E00;&#x306E;&#x5B89;&#x5B9A;&#x3057;&#x305F;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3084;&#x5BFE;&#x5FDC;&#x3059;&#x308B;DNS&#x540D;&#x306A;&#x3069;&#x3001;&#x4E00;&#x9023;&#x306E;&#x30DD;&#x30C3;&#x30C9;&#x3068;&#x305D;&#x308C;&#x3089;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&#x624B;&#x6BB5;&#x3092;&#x5B9A;&#x7FA9;&#x3057;&#x307E;&#x3059;&#x3002;
Service&#x306B;&#x306F;&#x3044;&#x304F;&#x3064;&#x304B;&#x7A2E;&#x985E;&#x304C;&#x3042;&#x308A;&#x3001;&#x305D;&#x306E;&#x3046;&#x3061;&#x306E;&#x3088;&#x304F;&#x4F7F;&#x308F;&#x308C;&#x308B;&#xFF13;&#x3064;&#x3092;&#x7D39;&#x4ECB;&#x3057;&#x307E;&#x3059;&#x3002;<br></p>
<h4 id="&#x30FB;clusterIP">3.9.1. &#x30FB;clusterIP</h4>
<p>ClusterIP&#x306F;Kubernetes&#x5185;&#x3067;&#x306E;&#x901A;&#x4FE1;&#x3067;&#x5229;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;&#x30AF;&#x30E9;&#x30B9;&#x30BF;&#x5185;&#x3067;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x304C;&#x6255;&#x3044;&#x51FA;&#x3055;&#x308C;&#x3001;&#x305D;&#x308C;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;Pod&#x9593;&#x3067;&#x901A;&#x4FE1;&#x3092;&#x884C;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p><img src="img/clusterIp.png" alt="Docker&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;"></p>
<h4 id="&#x30FB;NodePort">3.9.2. &#x30FB;NodePort</h4>
<p>NodePort&#x306F;Kubernetes&#x306E;Node&#x306E;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x306A;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x5916;&#x90E8;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x304B;&#x3089;&#x306E;&#x758E;&#x901A;&#x6027;&#x3092;&#x53D6;&#x3063;&#x3066;&#x304F;&#x308C;&#x307E;&#x3059;&#x3002; &#x305D;&#x306E;&#x5F8C;&#x306F;ClusterIP&#x306E;Service&#x3068;&#x540C;&#x69D8;&#x3067;&#x3059;&#x3002;</p>
<p><img src="img/nodePort.png" alt="Docker&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;"></p>
<h4 id="&#x30FB;LoadBalancer">3.9.3. &#x30FB;LoadBalancer</h4>
<p>LoadBalancer&#x306F;NodePort&#x306E;Service&#x3092;&#x4F5C;&#x6210;&#x3057;&#x305F;&#x4E0A;&#x3067;&#x3001;&#x3055;&#x3089;&#x306B;&#x5916;&#x90E8;&#x306E;LoadBalaner&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3001;LoadBalancer&#x306E;Upstream&#x3068;&#x3057;&#x3066;NodePort&#x3067;&#x758E;&#x901A;&#x6027;&#x3092;&#x53D6;&#x3063;&#x3066;&#x3044;&#x308B;&#x30DD;&#x30FC;&#x30C8;&#x3078;&#x8EE2;&#x9001;&#x3059;&#x308B;&#x3088;&#x3046;&#x8A2D;&#x5B9A;&#x3057;&#x3066;&#x304F;&#x308C;&#x307E;&#x3059;&#x3002;</p>
<p><img src="img/LoadBalancer.png" alt="Docker&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;"></p>
<h3 id="&#x30E9;&#x30D9;&#x30EB;(Label)">3.10. &#x30E9;&#x30D9;&#x30EB;(Label)</h3>
<p>&#x30E9;&#x30D9;&#x30EB;&#x306F;&#x3001;&#x30DD;&#x30C3;&#x30C9;&#x306A;&#x3069;&#x306E;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306B;&#x30A2;&#x30BF;&#x30C3;&#x30C1;&#x3055;&#x308C;&#x308B;&#x30AD;&#x30FC;/&#x5024;&#x306E;&#x30DA;&#x30A2;&#x3067;&#x3059;&#x3002;&#x30E9;&#x30D9;&#x30EB;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3001;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306E;&#x30B5;&#x30D6;&#x30BB;&#x30C3;&#x30C8;&#x3092;&#x6574;&#x7406;&#x3057;&#x3001;&#x9078;&#x629E;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;<br></p>
<h3 id="kubectl">3.11. kubectl</h3>
<p>API&#x7D4C;&#x7531;&#x3067;Kubenetes&#x3092;&#x64CD;&#x4F5C;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30C4;&#x30FC;&#x30EB;<br><br><br></p>
<h2 id="Kompose&#x3068;&#x306F;">4. Kompose&#x3068;&#x306F;</h2>
<p>docker-compose.yml &#x3092;k8s&#x7528;&#x306E;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x5909;&#x63DB;&#x3057;&#x3066;&#x304F;&#x308C;&#x308B;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;</p>
<div id="anchors-navbar"><i class="fa fa-anchor"></i><ul><p><a href="#Section1">Section1</a></p><li><a href="#">none</a></li><ul><li><a href="#&#x76EE;&#x6B21;">0.1. &#x76EE;&#x6B21;</a></li></ul><li><a href="#Docker&#x3068;&#x306F;">1. Docker&#x3068;&#x306F;</a></li><ul><li><a href="#&#x6982;&#x8981;">1.1. &#x6982;&#x8981;</a></li><li><a href="#&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3068;&#x306F;">1.2. &#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x3068;&#x306F;</a></li><li><a href="#Docker&#x306E;&#x30E1;&#x30EA;&#x30C3;&#x30C8;">1.3. Docker&#x306E;&#x30E1;&#x30EA;&#x30C3;&#x30C8;</a></li><ul><li><a href="#&#x30FB;&#x8CC7;&#x6E90;&#x306E;&#x52B9;&#x7387;&#x5316;">1.3.1. &#x30FB;&#x8CC7;&#x6E90;&#x306E;&#x52B9;&#x7387;&#x5316;</a></li><li><a href="#&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x5B9F;&#x884C;&#x74B0;&#x5883;&#x69CB;&#x7BC9;&#x306E;&#x5BB9;&#x6613;&#x3055;">1.3.2. &#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x5B9F;&#x884C;&#x74B0;&#x5883;&#x69CB;&#x7BC9;&#x306E;&#x5BB9;&#x6613;&#x3055;</a></li><li><a href="#&#x30FB;&#x8A2D;&#x5B9A;&#x9593;&#x9055;&#x3044;&#x306A;&#x3069;&#x306E;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x64CD;&#x4F5C;&#x306E;&#x5EC3;&#x68C4;&#x306E;&#x5BB9;&#x6613;&#x3055;">1.3.3. &#x30FB;&#x8A2D;&#x5B9A;&#x9593;&#x9055;&#x3044;&#x306A;&#x3069;&#x306E;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x64CD;&#x4F5C;&#x306E;&#x5EC3;&#x68C4;&#x306E;&#x5BB9;&#x6613;&#x3055;</a></li></ul></ul><li><a href="#Kubernetes(K8s)&#x3068;&#x306F;">2. Kubernetes(K8s)&#x3068;&#x306F;</a></li><ul><li><a href="#&#x306A;&#x305C;Kubernetes&#x306A;&#x3069;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x3042;&#x308B;&#x306E;&#x304B;">2.1. &#x306A;&#x305C;Kubernetes&#x306A;&#x3069;&#x306E;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x30AA;&#x30FC;&#x30B1;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x3042;&#x308B;&#x306E;&#x304B;</a></li></ul><li><a href="#Kubernetes&#x306E;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x6982;&#x8981;">3. Kubernetes&#x306E;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x6982;&#x8981;</a></li><ul><li><a href="#&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;">3.1. &#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;</a></li><li><a href="#&#x30AF;&#x30E9;&#x30B9;&#x30BF;(Kubernetes_Cluster)">3.2. &#x30AF;&#x30E9;&#x30B9;&#x30BF;(Kubernetes Cluster)</a></li><li><a href="#&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#xFF08;Control_Planes&#xFF09;">3.3. &#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#xFF08;Control Planes&#xFF09;</a></li><ul><li><a href="#etcd(&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x30C7;&#x30FC;&#x30BF;&#x30D9;&#x30FC;&#x30B9;)">3.3.1. etcd(&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x30C7;&#x30FC;&#x30BF;&#x30D9;&#x30FC;&#x30B9;)</a></li><li><a href="#API_Server">3.3.2. API Server</a></li><li><a href="#Scheduler">3.3.3. Scheduler</a></li><li><a href="#Kube_Controller_Manager">3.3.4. Kube Controller Manager</a></li><li><a href="#Cloud_Controller_Manager">3.3.5. Cloud Controller Manager</a></li></ul><li><a href="#&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#xFF08;Nodes&#xFF09;">3.4. &#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#xFF08;Nodes&#xFF09;</a></li><li><a href="#&#x30CE;&#x30FC;&#x30C9;(Node)">3.5. &#x30CE;&#x30FC;&#x30C9;(Node)</a></li><li><a href="#&#x30DD;&#x30C3;&#x30C9;(Pod)">3.6. &#x30DD;&#x30C3;&#x30C9;(Pod)</a></li><li><a href="#&#x30EC;&#x30D7;&#x30EA;&#x30AB;&#x30BB;&#x30C3;&#x30C8;(Replica_Set)">3.7. &#x30EC;&#x30D7;&#x30EA;&#x30AB;&#x30BB;&#x30C3;&#x30C8;(Replica Set)</a></li><li><a href="#Deployments(&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;)">3.8. Deployments(&#x30C7;&#x30D7;&#x30ED;&#x30A4;&#x30E1;&#x30F3;&#x30C8;)</a></li><li><a href="#Service(&#x30B5;&#x30FC;&#x30D3;&#x30B9;)">3.9. Service(&#x30B5;&#x30FC;&#x30D3;&#x30B9;)</a></li><ul><li><a href="#&#x30FB;clusterIP">3.9.1. &#x30FB;clusterIP</a></li><li><a href="#&#x30FB;NodePort">3.9.2. &#x30FB;NodePort</a></li><li><a href="#&#x30FB;LoadBalancer">3.9.3. &#x30FB;LoadBalancer</a></li></ul><li><a href="#&#x30E9;&#x30D9;&#x30EB;(Label)">3.10. &#x30E9;&#x30D9;&#x30EB;(Label)</a></li><li><a href="#kubectl">3.11. kubectl</a></li></ul><li><a href="#Kompose&#x3068;&#x306F;">4. Kompose&#x3068;&#x306F;</a></li></ul></div><a href="#" id="goTop"><i class="fa fa-arrow-up"></i></a>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: はじめに">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Section2.html" class="navigation navigation-next " aria-label="Next page: セクション２">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"セクション１","level":"1.2","depth":1,"next":{"title":"セクション２","level":"1.3","depth":1,"path":"Section2.md","ref":"Section2.md","articles":[]},"previous":{"title":"はじめに","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["search-pro-fixed","-lunr","-search","hide-published-with","anchors","navigator","collapsible-chapters","hints","copy-code-button"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"collapsible-chapters":{},"hints":{"info":"fa fa-info-circle","tip":"fa fa-mortar-board","danger":"fa fa-exclamation-circle","working":"fa fa-wrench"},"search-pro-fixed":{},"hide-published-with":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"navigator":{},"copy-code-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56},"embedFonts":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"mirameet","language":"ja","gitbook":"*"},"file":{"path":"Section1.md","mtime":"2020-11-18T11:06:29.091Z","type":"markdown"},"gitbook":{"version":"3.6.11","time":"2020-11-18T11:07:16.027Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <noscript>
        <style>
            .honkit-cloak {
                display: block !important;
            }
        </style>
    </noscript>
    <script>
        // Restore sidebar state as critical path for prevent layout shift
        function __init__getSidebarState(defaultValue){
            var baseKey = "";
            var key = baseKey + ":sidebar";
            try {
                var value = localStorage[key];
                if (value === undefined) {
                    return defaultValue;
                }
                var parsed = JSON.parse(value);
                return parsed == null ? defaultValue : parsed;
            } catch (e) {
                return defaultValue;
            }
        }
        function __init__restoreLastSidebarState() {
            var isMobile = window.matchMedia("(max-width: 600px)").matches;
            if (isMobile) {
                // Init last state if not mobile
                return;
            }
            var sidebarState = __init__getSidebarState(true);
            var book = document.querySelector(".book");
            // Show sidebar if it enabled
            if (sidebarState && book) {
                book.classList.add("without-animation", "with-summary");
            }
        }

        try {
            __init__restoreLastSidebarState();
        } finally {
            var book = document.querySelector(".book");
            book.classList.remove("honkit-cloak");
        }
    </script>
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-pro-fixed/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro-fixed/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-published-with/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-collapsible-chapters/collapsible-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

